{
    "success": 1,
    "firm_name": "Rager & Yoon",
    "message": "Google Reviews Successfully Extracted.",
    "totalCount": 40,
    "reviews": [
        {
            "id": "115336744105266964479",
            "title": "Paola",
            "description": "I cannot express enough gratitude for the incredible support provided by Rager & Yoon. Their dedication and commitment to their clients and their families are truly admirable.Throughout my mother's case, Rager & Yoon went above and beyond, demonstrating exceptional professionalism and expertise. Their guidance and mentorship have not only helped my family but also inspired me to pursue a career in law myself.As a law student now, I can confidently say that Rager & Yoon has had a profound impact on my journey. Their unwavering dedication to justice and their clients is truly inspiring.I would also like to mention that Jeff is not only proficient in their legal practice, but they also value inclusivity. As a bilingual individual, I appreciate their commitment to assisting Spanish-speaking clients. Their willingness to bridge language barriers and provide equal access to justice is commendable.In conclusion, I am forever grateful for Jeff's support and guidance. Their exceptional legal expertise and genuine care for their clients make them an outstanding attorney.If you're looking for a dedicated and compassionate attorney, I highly recommend Jeff Rager. You won't be disappointed!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocJMG5HLw4LJQO-06vNVJ-FqW8VPJ-3XU2ZFqxr1IN305yvB4g=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s115336744105266964479!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "4 months ago"
        },
        {
            "id": "107521843343834720588",
            "title": "G M",
            "description": "I’m a physician who has always been devoted to being an advocate for the patients who are entrusted to my care. My patient advocacy conflicted with my previous employer’s desire to place profits before patient care. This was unacceptable to me, and in searching for an attorney that would fight for justice, I found Mr. Rager. During one of the hardest chapters of my life, Mr. Rager was a zealous advocate for me. We fought until the bitter end and gave this behemoth of a corporation a run for their money, literally. While justice is not always perfect, I am proud we stood up for our principles and we made a formidable team. I highly recommend Mr. Rager as a zealous advocate for his clients and know that without him I would not have been able to fight for the proper treatment my patients deserved.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLJgWn3lDPl4Q10sePM1VO4_k_8miQB9pQp9aMIP2duQKSFiBbF=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s107521843343834720588!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "115634879389804795907",
            "title": "Raj Subramaniam",
            "description": "I am physician , was started my first job in new corporate company, around Feb,2013. After few months passed, I start to feel too much pressure in working place environment , so I had plan to quit my job, prior to the contact term finish. But, I have noticed that, the contract was binding contract , I was threatened by many people inside and out the company.  Who had bad experiences, noticed bad events , who ever leaving early from them. Then , I did seek two attorneys but , all of the sudden, they put me in doomed position with few days notice.Now , myself and my wife believed only the god!!. Yes!, who was introduced by another attorney Mr.Pedroza, in Los Angeles ,the excellent legal knowledge, too honest ,too humble, much humanity apart from all excellent leadership, decisions making person.After I received the court sue notice \/orders , he gave the corporate company ,many chances\/ time to withdraw, with great respect , humanity. He gave  time realize the facts , even beyond, nicely explain them they are wasting times and money . Finally , they took 5 years to realize the facts , though the company and their attorney played unethical tactics , but truth stood strong. The person , I mentioned above as god , he is Mr.Jeff Rager.He is highly professional, good hearted man, and his all staff too includes attorney Mr. James , secretary Ms.Alana and others. Mr.Jeff is very kind full, not money minded , best attorney , I have ever seen in my carrier.He is not only helped me and my family , but he did help many doctors , nurses and paralegals staff , to get more benefits, more than 40 year old organization cultural and strategy changes, contract changes, apart from this all, he helped indirectly helped many patients to get good health care by his actions.When I started the court case, I have not enough materials,documents , but Mr. Jeff got some thing later during deposition , but he dig through a lot, by his very hard , dedicated , well planned work ethical work, at the end he got many more materials to get the success.Openly, I have not find appropriate best words to explain his personality and professionalism. The best of best . He is a client well wisher. Mr. Jeff always put , Client safety and wealth than his legal fight. I left all decisions to him, he took care everything. Honestly, I did not do much, but he did all with passion and hard work. Mr. Jeff knows throughly about the case , statements, documents , even our statements we forgot.Mr.Jeff, is Highley protective to client , he always will be side by side , in each deposition , even to our witnesses.Even some point we have to go for appeal against the re-appeal by the company , Mr. Jeff ,took every steps and helped me a lot, I could not find words to describe that situation and his timely humanitarian helps.If anybody got as attorney Mr.Jeff, for their case , I will say , the client is very lucky , even a jackpot. I will recommend him 100 % .One thing I have realized is, ‘ if you do some thing good,  for known  \/ unknown people in your life , god will send , someone , who is unknown person to help when you are in hard time’!!.  I do remember that in my practice , many times , I told the patients, don’t worry about money  , I’d have enough many from other patients , same word I got many times from Mr. Jeff . This is the place I would believe god is everywhere!!.Also, I appreciate the current in charge team in my previous company , who took wise decision and also doing lot changes in taking care staff and patients .All appreciation goes to Mr.Jeff Rager. We pray for him and his family to get all best wishes and continue to help many people like my family.Dr.Rajarathinam . MD USA, MD India, MBBS, MBACurrent Fresno , CA",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjViMmMsoEhcncNvYYNHVf7fcplnVFiYnmEupmGjy0WcMOrDfYIG=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s115634879389804795907!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "3 weeks ago"
        },
        {
            "id": "105795427677423960672",
            "title": "A L",
            "description": "It was a hard time in my professional life when I reached out to The Rager Law Firm for help. I was in the fight of my life against an employer with nearly unlimited resources and a large team of lawyers. I was utterly intimidated as my former employer vigorously sought to achieve their goal of seeing me simply go away. So ruinous was their campaign against me, I was losing faith in myself and was beginning to question my own sanity. Nonetheless, I documented everything, and conducted myself in a professional, moral and legal manner at all times. Even when Security marched me out of the building with a box in my hands.Jeff Rager and his team listened to my story carefully. They reviewed my documentation. With great care, compassion, and understanding, he expertly guided my through the steps to seek justice and resolution. He advised and advocated for me throughout the process, expertly helped me manage risk, and in the end, I was highly satisfied with the result. Jeff restored my faith in myself, the law, and ultimately changed my life in a very positive way.If your employer broke the law, you can find justice. If you're not sure if your employer broke the law, call Jeff Rager and make an appointment. He will know if you have a case, and how to proceed. Don't wait- there is a time limit for you to initiate legal action. Call him today.I must recommend The Rager Law Firm for you. He helped me, and I cannot thank him enough for everything he did for me and my family!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocKtPF0QXyRlavu0bd5zE_kK0avvFYQJVpXeqXhYXiYgmmAcdQ=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s105795427677423960672!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "108395681971435978934",
            "title": "Donna Garcia",
            "description": "Divine providence led me to the Rager Law Firm when I needed to retain strong legal representation on behalf of a family member.Just from my initial call with James Yoon, I knew there was no need to “Google” other law firms. James expertly guided us in the weeks that followed with the utmost professionalism, clarity, patience, and most importantly, kindness and empathy. James was consistently calm and collected as he responded to our questions and concerns and explained various aspects of the case\/process. Our voices were heard and validated compassionately.Likewise, Jeff Rager was assertive in the most compelling and effective way possible. He thoroughly understood and brilliantly argued the merits of the case, fiercely protected my family member’s best interests, and “went for the jugular,” resulting in a win with minimal effort on our part, except to show up with the facts and the truth about our situation. Jeff did not relent, and to say that we were pleased with and grateful for the outcome of his efforts is an understatement. That he was courteous and respectful to me and family made our experience that much more remarkable.Shout-out to Alana and Ashley who were exceptional in their follow-up and support as well.Wisdom, honesty, integrity, and trustworthiness might seem rare in the business world these days, but such virtues are alive and well among the Rager team. Truly well done!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocIrlHDapzvvhFengtWVegzMqv9BmuBQmSbUyXnqVtWqs8TQCw=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s108395681971435978934!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "2 years ago"
        },
        {
            "id": "108688315122298709451",
            "title": "Clarence Jones",
            "description": "I want to give thanks to Mr. Jeff and Mr. James and their team for all their hard work. It took 3 years that they were working on my case and took a lot of their time, but they were patient with me kind and got the job done. I would recommend this company to anybody that needs a good Lawer. Rager Law Firm keep up the good work.and thanks again for all your hard work.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjUnhtObC-mxZRUH3JD6Tgs5YDQFsAhuuW_WjFpfEH0GrLzZUtjl=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s108688315122298709451!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "111370955742790966858",
            "title": "Lauryn Vargas",
            "description": "I have had the pleasure of being represented by the Rager Law Firm and I can’t thank them enough as I was in the best hands. Jeff, James, Ashley & Alana were amazing and guided me through the whole lawsuit process. The team was very responsive and kept me informed as this was my 1st time needing legal counsel and I wasn’t sure what to expect. Jeff & James believed in me & the case & never gave up on me. They worked around the clock to make sure the truth was put out in front of the judge and jury and they did an amazing job with telling my story and showing evidence that I was wronged.We faced a few challenges but that didn’t hold the team back or make us fold. If anything, it made us fight harder for the truth. I couldn’t have asked for a better team to represent me on the matter & would definitely recommend the Rager Law Firm to have your back. I was treated with respect and the team carried themselves very professional in the courtroom and kept their cool. I can’t say the same for the defense side. I feel a sense of Justice was served even though I wish I didn’t have to go through what I went through. I am very grateful and appreciative that the Rager Law Firm brought closure to a difficult time in my life and I can move on.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLxrfid5YBkYtec8hi0IpZS3uyqM4Bv56eRJYob_jWl-bQtjQ=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s111370955742790966858!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "2 years ago"
        },
        {
            "id": "104657203413907166960",
            "title": "Ann",
            "description": "I had the pleasure of being represented by Rager law firm after being wrongful terminated for a company that I worked for 20 years. Ashley and Jeff are amazing. They always kept me informed about what was happening with my case.They are very knowledgeable always answering any questions I had for them. They have a fantastic team. I highly recommend them.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocKIp_0wOgc0K_cG7xxPwIFGU4JGbpzB4sCzHbJEt_vakcq6Sg=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s104657203413907166960!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "111194201846652539174",
            "title": "SUSAN DENARDO",
            "description": "I filed a wrongful termination lawsuit with the Rager Law Firm when I was fired after working for the same acute care hospital for over 40 years. I had interviewed many attorneys and chose wisely. He and his associates are top notch. Thanks to Jeff, James and Alana, the outcome was well worth the time, hard work and effort. They worked together as a great team. Jeff is extremely knowledgeable and professional. He is honest and straightforward and is passionate about his clients. He is analytical, focused and tenacious. These are all the traits that we look for in an attorney. My questions were always answered immediately and I felt confident in my decision to choose him. I would recommend him to anyone at anytime. This has been a blessing.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjXhkdb3LQrG_bKmB53J7L5IK9v7dk9EZZKCXfsCGN93nJ80_Yg=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s111194201846652539174!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "3 years ago"
        },
        {
            "id": "107219044768132258601",
            "title": "L B",
            "description": "It is true that God brings the right people into your life at just the right time. Jeff has been that person for me!I recently sought Jeff’s help to navigate through the difficult, painful process of filing a discrimination \/ harassment complaint against my previous manager.Jeff was very knowledgeable about my situation and confirmed what I knew to be true but was reluctant to accept. He was honest and upfront as well as kind and patient with me. He always made time for me and was quick to respond. He patiently walked me through the process of proper communication with HR and my manager. I always felt he was in my corner fighting for me and he was literally my only advocate. He is truly a blessing and I highly recommend him!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocIYAuGQN_HHdzEXqiRfcDt4dundXisl9Sqxe6iHIfOcd0D5MA=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s107219044768132258601!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "2 years ago"
        },
        {
            "id": "104901599426005272475",
            "title": "Iris lin",
            "description": "I really appreciate the whole team from personal to professional help with the case.  They are the best in town.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjUqQZ4q77egX2u7a4isHFll3oYOE7GQfnEoi5HHqICUl9i7obE=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s104901599426005272475!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "4 days ago"
        },
        {
            "id": "111723166443336544909",
            "title": "Brianne Rigoli",
            "description": "The Rager law firm is absolutely Amazing! I was wrongfully terminated from my employer back in 2014, I was devastated and reached out to several attorneys all who wouldn't take my case, until I found Jeff Rager who said he could help me. Jeff and his team fought for 5 years to help me get justice. I am so thankful they believed in me and my case and pushed me to fight on even when I was so stressed and ready to just give up. They worked many hours on my case and are very knowledgeable with the law and people's rights. Jeff was great at trial, very professional, I would higher them again in a heartbeat. I highly recommend using them.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocKXosaWVNzOUKvPsYZaI9tUKsY2gVsJxkIU6BTzcXI69UUowA=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s111723166443336544909!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "4 years ago"
        },
        {
            "id": "105282647307569997253",
            "title": "Narges Pazouki",
            "description": "Mr. Rager took care of my case and help to save my business; he was able to challenge a big institution. He helped us throughout the entire process and his office was professional. Even years later, Mr. Rager is still available to answer any questions I might have. I recommend Rager Law Firm to all my friends and family.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLOpg80i6MxqUoyh5ft_WzjPd5UUrboCyb9kvwWueZ80h6ysLc=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s105282647307569997253!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "113454727506637998617",
            "title": "Sam Yam",
            "description": "The Roger Law firm has demonstrated outstanding performance in representing  me as there client with outmost care. They have showed care and profession from the beginning of the case to the end and were always attentive to any questions and concerns that I had. In the future I’ll definitely use this firm and recommend there profession to any of my friends or family. Thank you!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLrcpcZP_ZIkYk-QIOWRgm654XJPcne8R29cWQjhMDvwtLlDQ=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s113454727506637998617!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "110092210223923738349",
            "title": "Maura Concannon Shockey",
            "description": "Rager and Yoon are one of the best wrongful termination attorneys in Los Angeles. They have reasonable pricing, are very detail oriented, and work quickly. Highly recommend!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocIcgFc2CuNpbA7knh3sBejACzgdAm4DuKO4xz752d_m1W08GQ=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s110092210223923738349!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "7 months ago"
        },
        {
            "id": "107996826475841931052",
            "title": "Lawrence Villa",
            "description": "Attorney Jeff Rager is a super lawyer. He's smart and intelligent and I was so happy to have him as my attorney representing me on my wrongful termination case. He explained everything in detail of my case and made sure that I completely understood what was going on and I really appreciated that. If I had any questions about my case or concerns he would answer them immediately. Jeff handled my case with professionalism leading to a very happy settlement. If Jeff Rager accept you as a client in handling your case then you are definitely in good hands.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLs6j9Aj8fIJHqQihUfjbiIosSqf2JO72hHLMY2cLypqMTvhg=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s107996826475841931052!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "6 years ago"
        },
        {
            "id": "116679494718067755867",
            "title": "Jackie M",
            "description": "I was a professional employee for over 17 years at a very large medical corporation. I was wrongfully terminated and retaliated against after reporting a major situation at work. I was completely devastated and it affected my entire life.From the first day I met with Jeff and his associate, James Yoon, they were professional yet empathetic and understanding of what I was going through. They were always supportive, available to address my questions and concerns, and made the whole experience much easier.I was very satisfied with the outcome and would absolutely recommend Jeff and James to my closest friends and family. Thank you Rager Law Firm!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocKjwaRXTJ-BOam1FobgQTVYOHMzUoVxeY2_PbPjKK2G1ojg=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s116679494718067755867!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "4 years ago"
        },
        {
            "id": "111726690118208209640",
            "title": "Kristina Adel",
            "description": "This firm did a great job with my harassment and discrimination case. I never thought anything would happen in my life where I would have to sue my employer, but I'm glad this team was there for me when I did. They explained how civil lawsuits are different than government action, and all the steps that came before, during, and after the lawsuit itself. We won and the outcome was fair. They made everything as easy on me as they possibly could. I know it took a lot of expertise and will for this team to fight on my behalf, against a large corporation with a problematic culture. That company is now being sued by several government agencies, but this firm helped me stand up to them as one of the first cases brought to light. The team was there for me, and they still are whenever I need them.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjU-6SUHy-PuOaedR7oKWB3-Bn9xDqDRAy_TtJcBzAuuoTG0wUxJ=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s111726690118208209640!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "112442506550267926518",
            "title": "Vanessa Blanco",
            "description": "Jeff Rager and his team came highly recommended to me and now I know why.  From the onset, Jeff immediately listened to me, collected the facts, analyzed my situation, realistically evaluated my case, and told me what to expect during each gateway of this legal process.  Prior to meeting Jeff, I was hesitant to commence a lawsuit against a goliath of a company as I was unsure that justice would be achieved.  This company had already mistreated me, cast me aside and made me feel that I had no voice after nearly 20 years of successful service and loyalty to them.  My whole world was turned upside down and I was emotionally wrecked.  Jeff made me feel empowered and was with me every step of the way.  I have never met more professional, reliable, responsive, and caring people!  It was just what I needed as I traversed this precarious path.  I felt that I had people on my side, giving me my voice back against this goliath.  I highly recommend Jeff Rager as I could not be happier with the outcome – it has changed my life in many ways, and I can finally heal!  Jeff and his team are one of the more knowledgeable firms out there, so do not waste your time looking any further – you can get your life back, I am living proof!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLGy3dccaxHkmHmXOOasYr27rGpTUSDu-oC9AjGJrgWHFHCkA=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s112442506550267926518!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "3 years ago"
        },
        {
            "id": "106869255647202545364",
            "title": "Robert Wascher",
            "description": "Jeff is, without question, the most passionate, hardworking, ethical and competent attorney I have ever met. We retained him to file a lawsuit against a $53 billion a year company that went on to hire an army of lawyers from two national law firms to represent them.Going up against this giant and powerful organization, and its horde of attorneys, was one of the most stressful experiences I have ever gone through. But throughout the entire 4-year battle, Jeff was there to encourage and support us.  For months, as the trial date approached, and during the trial itself, he worked on our hugely complex case 7 days a week, often staying up until the wee hours of the morning to prepare for trial.  His devotion, commitment, passion, and kindness carried us through some very challenging and scary moments during those 4 years, including the many times when we felt that we could no longer go on with our lawsuit against this Goliath.I really can’t say enough positive things about Jeff.  If he believes in the merits of your case and accepts you as his client, you can be assured that nobody will work harder, more passionately, or more competently on your behalf than Jeff.  He is an exceptional attorney, a kind and caring human being, and, quite frankly, a giant-slayer.  I will never forget his courage and self-confidence in going up against the army of aggressive lawyers hired by the defendant.  (In the end, we won our case, and to the obvious surprise of the arrogant and powerful defendants and their legion of attorneys.)Jeff is a credit to a profession that is often not viewed very favorably.  He is honest, ethical, extremely knowledgeable, and once he accepts a case, he will work himself to the point of exhaustion to seek justice on behalf of his clients.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjUszmoPjONO5bGYDSpqNkh41jQXCe-L813flwWCE2SP_9Bn8p_LDQ=s40-c-rp-mo-ba4-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s106869255647202545364!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "8 years ago"
        },
        {
            "id": "114518425970348221862",
            "title": "M Y",
            "description": "Mr. Rager and his law firm were recommended to me as one of the highest ranked employment attorneys in the southern California region. After watching how he handled my case I was convinced he is one of the country's top employment law attorneys.I retained him in 2012 for what turned out to be a 3-year legal battle against a large government agency with what seemed to be endless funds and large staff of lawyers.  Other attorneys had feared taking on this entity and advised me that the chances of success were slim to none.  Mr. Rager sat with me for my initial 1 hour consultation and had a different view altogether and accepted my case.I found Mr. Rager to be a passionate, meticulous, extremely hardworking, and brilliant attorney.  Over the course of the 3 years that it took to finally get my settlement, he guided me through the overwhelming experience of filing a lawsuit, giving and taking depositions, and, finally, settling the case. He never once feared taking the case to trial if he did not feel the amount of settlement was not sufficient.At the end, despite the incredible arrogance of the defendants and their legal team, we were victorious.Despite his success in holding employers accountable for their unethical and malicious behavior against their employees, I found Mr. Rager different from other lawyers, he truly cared and understood the pain I was going through both professionally and personally. He continued to give me great advice throughout the entire experience and I am forever grateful...GOD BLESSIf Mr. Rager accepts your case, then you are one of the very lucky few, and should know that you have the best legal representation in the country.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocKQ2CP7B1DjFTMHMxubL_hgc59BAplx_qC1kAJbm-dFsirLNA=s40-c-rp-mo-ba4-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s114518425970348221862!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "8 years ago"
        },
        {
            "id": "113239831214828751373",
            "title": "Karen Brown",
            "description": "Thank goodness I found Jeff. I worked for a company for nearly a decade as the discrimination became worse and worse. I went to Jeff when I was at my lowest. He listened and then agreed to take my case. Which he will not do unless he believes you have a case. He was honest and direct with his feedback. I had never hired an attorney before and never thought I would. He revitalized my confidence in the legal system. He will tell you everything honestly and without legal jargon. At all times you will know and understand where your case stands.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLIdhHH_HzRoFoDxCODo4sjCFinR794y92APRcTEVntOyacuA=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s113239831214828751373!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "4 years ago"
        },
        {
            "id": "103222850140394515875",
            "title": "Dawn Woodrum",
            "description": "After being at a company for 18 years I had to have carpel tunnel surgery.  Upon returning to work I found that the company would not let me return.  They forced me to run out my FMLA then told me I no longer had a job.  They would not acommidate any modified work restriction. I felt that I was treated unfairly and discremanated against do to medical conditions. When I was told I no longer had a job I was devastated.  I knew I was treated unfairly so I called multiple lawyers.  I decided to go Jeff Ragers law firm and let me tell you it was the best decision of my life. It was a very long process but well worth it.  They kept me updated and well informed of the process all the way.  His professionalism and knowledge can't be beat. We ended up settling for twice the amount I thought I would recieve. Jeff Rager Law Firm changed my life for the good!! I very highly recommended Jeff Rager!!!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjWT4-kUeFOLsJO47kz4u3zV3twkr7QfUQWyW0EIkHFUfFqO3B5w=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s103222850140394515875!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "4 years ago"
        },
        {
            "id": "111073671494224750543",
            "title": "Angela Vannucci",
            "description": "Jeff is amazing and takes great care in determining the best course of action for his clients! I would recommend Jeff to anyone who is seeking someone who is honest, reliable, knowledgable and is well-respected in his profession!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjUaHRiX0piPvJvl9DEyXVr_dJF6Z6jMoSwZ1xBEbURFcF__zNw=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s111073671494224750543!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "117290681824710399434",
            "title": "Marcia Kelly",
            "description": "I could not of  ask for a better wrongful termination attorney! He was very professional, warm and very knowledgeable about all the elements in my case.He took personal interest in my case from day one through a successful settlement  He made me feel like I was the most important client he had.  I would strongly recommend the Rager Law  firm.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocJtYwvoheMfm7-BJxxXnhR-LiDJ0OuSnG6AxaOQHoXGznaIQA=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s117290681824710399434!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "3 years ago"
        },
        {
            "id": "103731491136517826489",
            "title": "Ullysses Ornelos",
            "description": "It was a long road, and I persevered with the help of Mr Rager, he always kept me in the loop, was always open and gave his most honest opinions. He communicated regularly with me about what was going on with my case. He’s very trustworthy. He’s very knowledgeable and experienced in his field and for that reason we got the results we wanted!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjWTf4jdlyln75lzwYReEuoFRrxK5KvVF0FWMyXCvK4wsRT6imvS=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s103731491136517826489!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "5 years ago"
        },
        {
            "id": "103036194243452105576",
            "title": "K R",
            "description": "I recently was represented and without hesitation would highly reccomend Rager Law Firm. After listening to my complaints Jeff was more than willing to fight for my rights. I feel he went above and beyond my expectations. Thank you Jeff for making my case matter!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocJ-QwLg7lpHLvEkF6enIQoeUtfH3pSa7Xk7ZwXYqLqgXk2HBQ=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s103036194243452105576!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "4 years ago"
        },
        {
            "id": "116458310680705581915",
            "title": "Rafaela Velasquez",
            "description": "Attorney Rager,  great Attorney, passionate, professional, I was so lucky to have him on my side.  God puts the right people in your life and he sure did for me.  I was so lost so depressed after I was fired from my 30 year employment, didn't know what to expect. The respect and treatment that I received from him was the best, they don't waist your time, they investigate your case first and they tell you exactly if you have a case or not, they are very honest and don't give you false hopes.  They work so hard on my case, all I can say is,  THANK YOU",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjVV0pxqRac_yGEf00weu8qV1gX9vNRiLSlhP9JvVWP6UAUYTJCN=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s116458310680705581915!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "3 years ago"
        },
        {
            "id": "101727029053755364653",
            "title": "Natalie Petty",
            "description": "Mr. Rager and his firm did right by me. It was not easy because of the vast corruption they were up against. Nevertheless, they weren’t swayed and navigated my case to a positive outcome. I am grateful.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjVJzlI-nHzTjDYTnV0faNXfzPxDLF-S5xFLOFB8fMdU5H8FOKc=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s101727029053755364653!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "105734499852327346721",
            "title": "Patrick Taylor",
            "description": "Jeff was great to work with. He laid out options and provided guidance but left the decisions to me. I recommend him highly.",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocJz6GIRQkn-kksT6qRSywvLSJVTmylz4Jv0QFyMDs83Xu5M4w=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s105734499852327346721!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "110606860234771992921",
            "title": "Vaozter Fuimaono",
            "description": "\"Patient, thorough, and incredibly supportive\"\"Had an incredible experience with Jeff Rager and would recommend him to anyone looking for a lawyer. I had never been involved in a law suit before so was understandably nervous and uncomfortable. Jeff was patient, thorough, and incredibly supportive throughout the entire process. 100% satisfied. (And I won.)\"-Raul Fuimaono",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjWi0OjHxAlpFCzZghdrBuiqsBuAnXjB-M-sIF4noueaEtZ32HKW=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s110606860234771992921!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "8 years ago"
        },
        {
            "id": "113550917880550070677",
            "title": "우리 Woori마마미야",
            "description": null,
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjWXqdDJoJkRYAcruo6IPxIKOGFuLiNrON5a2A7BGWajEomJQNN6=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s113550917880550070677!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "5 years ago"
        },
        {
            "id": "109415977325985884274",
            "title": "Eric Baker",
            "description": "Rager & Yoon are fantastic employment lawyers!  They will stand up against the corporations for their clients!",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjWS2NOaKLblgxDU6-OkbAz8BCpkXEJuWKWWZtLRoXgGJcEZC0Q=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s109415977325985884274!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "7 months ago"
        },
        {
            "id": "109998391052265057305",
            "title": "Steven Kohr",
            "description": "When I had some issues with my job it was a blessing to come across Jeff and Melanie best lawyers around And there with you every step of the way",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocIAmI5e6Qa2aK34SvZvPz8TuHXPvoWgCOTddceojpWDtxPbNg=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s109998391052265057305!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "116317115813964551217",
            "title": "Ana Valdez",
            "description": "The lady that contacted me was very rude she did not let me speak while I was explaining my story. At the end she cut me off and said I’ll send you a email of a link to other attorneys and be at of luck. Very rude",
            "numericRatingCount": 1,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocIHsu4YyP-NpoxxDn7KIrB2DDq3IlTF43s3zDRaCwpGt07s8VKG=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s116317115813964551217!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "111858194480326442294",
            "title": "Edward Celio",
            "description": "“I highly recommend this business.”",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLWHVZ6H63qBlgI4XJALi6fHADX8j3E8ta0eJTVe7dElraGGw=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s111858194480326442294!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "3 months ago"
        },
        {
            "id": "104265490017807455017",
            "title": "mymd11 Boeing747",
            "description": "Look up which law school the attorneys went.  One lawyer doesn't even speak English that well.  Very heavy accent.  I would not retain a lawyer from this firm",
            "numericRatingCount": 1,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjURiEV-Emvx3kFt4fbD3fiIKLq-T7kxsB3pzCu7WqSdC2udVxBG=s40-c-rp-mo-ba5-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s104265490017807455017!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "4 years ago"
        },
        {
            "id": "111555407343880648950",
            "title": "Lloyd Revels",
            "description": null,
            "numericRatingCount": 1,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjUYHqBZ6kfCXHYyDSrA4vz44pwBffjHvaf4VhU7jsDKly1TOoGS=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s111555407343880648950!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "7 years ago"
        },
        {
            "id": "107456322520191145818",
            "title": "Valery Enow",
            "description": "Very hospitable",
            "numericRatingCount": 5,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocK61UjAnv0YVOxrJSBA7Z8GVeyh8hh4rb1BeRa3sYiEjqZOSg=s40-c-rp-mo-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s107456322520191145818!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        },
        {
            "id": "115297965012449763785",
            "title": "Jeniffer Rodriguez",
            "description": null,
            "numericRatingCount": 2,
            "reviewerPictureUrl": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjV4T3yGUdOb9vxjUJ9h-fEfiF11XMEvCwuN5ceO5eiusa8Ox88Y=s40-c-rp-mo-ba3-br100",
            "reviewerUrl": "https:\/\/www.google.com\/maps\/reviews\/data=!4m5!14m4!1m3!1m2!1s115297965012449763785!2s0x80c2caaecfce1ea1:0x48e995453b1a0449",
            "publicationDate": "a year ago"
        }
    ]
}